In [ ]:
import yfinance as yf
yf.download('AAPL')

In [ ]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = yf.download(ticker)
all_data

In [ ]:
all_data = {ticker:yf.download(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
all_data

In [ ]:
all_data['AAPL'].info()

In [15]:
all_data['AAPL'][('Close', 'AAPL')]

Date
1980-12-12      0.098834
1980-12-15      0.093678
1980-12-16      0.086802
1980-12-17      0.088951
1980-12-18      0.091530
                 ...
2024-12-16    251.039993
2024-12-17    253.479996
2024-12-18    248.050003
2024-12-19    249.789993
2024-12-20    254.490005
Name: (Close, AAPL), Length: 11099, dtype: float64

In [ ]:
for key,value in {'tw':'taiwan','jp':'japan'}.items():
    print(key)
    print(value)

In [17]:
new_data = {key:df[('Close', key)] for key,df in all_data.items()}

In [18]:
import pandas as pd
pd.DataFrame(new_data)

                  AAPL         IBM        MSFT        GOOG
Date
1962-01-02         NaN    1.513319         NaN         NaN
1962-01-03         NaN    1.526549         NaN         NaN
1962-01-04         NaN    1.511335         NaN         NaN
1962-01-05         NaN    1.481572         NaN         NaN
1962-01-08         NaN    1.453794         NaN         NaN
...                ...         ...         ...         ...
2024-12-16  251.039993  229.330002  451.589996  198.160004
2024-12-17  253.479996  228.970001  454.459991  197.119995
2024-12-18  248.050003  220.169998  437.390015  190.149994
2024-12-19  249.789993  223.919998  437.029999  189.699997
2024-12-20  254.490005  223.360001  436.600006  192.960007

[15852 rows x 4 columns]